### List of Changed Stacks

```bash
stacks/client-1
stacks/original
exitcode=0
stdout<<EOF
stacks/client-1
stacks/original
EOF
stderr<<EOF
EOF
```

#### Terraform Plan

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.master-module.aws_instance.master_instance will be created
  + resource "aws_instance" "master_instance" {
      + ami                                  = "ami-07caf09b362be10b8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Client" = "client-1"
          + "Name"   = "client-1_master_instance"
        }
      + tags_all                             = {
          + "Client" = "client-1"
          + "Name"   = "client-1_master_instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.master-module.aws_subnet.master_public_subnet will be created
  + resource "aws_subnet" "master_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.160.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Client" = "client-1"
          + "Name"   = "client-1_master_subnet"
        }
      + tags_all                                       = {
          + "Client" = "client-1"
          + "Name"   = "client-1_master_subnet"
        }
      + vpc_id                                         = "vpc-07d4e8828e405ba5b"
    }

  # module.master-module.aws_vpc_security_group_egress_rule.allow_slave_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_slave_egress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_internet_traffic_global will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_internet_traffic_global" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_slave_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_slave_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.sg.aws_security_group.master_sg will be created
  + resource "aws_security_group" "master_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic and all outbound traffic to the master of client-1"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "client-1_master_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "client-1"
          + "Name"   = "client-1_master_sg"
        }
      + tags_all               = {
          + "Client" = "client-1"
          + "Name"   = "client-1_master_sg"
        }
      + vpc_id                 = "vpc-07d4e8828e405ba5b"
    }

  # module.sg.aws_security_group.slave_sg will be created
  + resource "aws_security_group" "slave_sg" {
      + arn                    = (known after apply)
      + description            = "Segurity group for the slave structure of the client client-1"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "client-1_slave_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "client-1"
          + "Name"   = "client-1_slave_sg"
        }
      + tags_all               = {
          + "Client" = "client-1"
          + "Name"   = "client-1_slave_sg"
        }
      + vpc_id                 = "vpc-07d4e8828e405ba5b"
    }

  # module.slave-module.aws_autoscaling_group.slave_asg will be created
  + resource "aws_autoscaling_group" "slave_asg" {
      + arn                              = (known after apply)
      + availability_zones               = [
          + "us-east-1a",
          + "us-east-1b",
        ]
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 4
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 4
      + name                             = "client-1_asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # module.slave-module.aws_launch_template.slave_launch_template will be created
  + resource "aws_launch_template" "slave_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-07caf09b362be10b8"
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "client-1_template"
      + tags_all               = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Client" = "client-1"
              + "Name"   = "client-1"
            }
        }
    }

  # module.slave-module.aws_subnet.slave_public_subnet will be created
  + resource "aws_subnet" "slave_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "client-1_slave_subnet"
        }
      + tags_all                                       = {
          + "Name" = "client-1_slave_subnet"
        }
      + vpc_id                                         = "vpc-07d4e8828e405ba5b"
    }

  # module.slave-module.aws_vpc_security_group_egress_rule.egress_from_master_sg will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Egress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.slave-module.aws_vpc_security_group_ingress_rule.ingress_from_master_sg will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Ingress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.slave_asg will be created
  + resource "aws_autoscaling_group" "slave_asg" {
      + arn                              = (known after apply)
      + availability_zones               = [
          + "us-east-1a",
          + "us-east-1b",
        ]
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "original_implementation_asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # aws_instance.master_instance will be created
  + resource "aws_instance" "master_instance" {
      + ami                                  = "ami-07caf09b362be10b8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.large"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_instance"
        }
      + tags_all                             = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_launch_template.slave_launch_template will be created
  + resource "aws_launch_template" "slave_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-07caf09b362be10b8"
      + instance_type          = "t2.small"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "original_implementation_template"
      + tags_all               = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Client" = "original_implementation"
              + "Name"   = "original_implementation"
            }
        }
    }

  # aws_security_group.master_sg will be created
  + resource "aws_security_group" "master_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic and all outbound traffic to the master of original_implementation"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "original_implementation_master_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_sg"
        }
      + tags_all               = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_sg"
        }
      + vpc_id                 = "vpc-07d4e8828e405ba5b"
    }

  # aws_security_group.slave_sg will be created
  + resource "aws_security_group" "slave_sg" {
      + arn                    = (known after apply)
      + description            = "Segurity group for the slave structure of the client original_implementation"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "original_implementation_slave_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_slave_sg"
        }
      + tags_all               = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_slave_sg"
        }
      + vpc_id                 = "vpc-07d4e8828e405ba5b"
    }

  # aws_subnet.original_subnet will be created
  + resource "aws_subnet" "original_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.144.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_subnet"
        }
      + tags_all                                       = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_subnet"
        }
      + vpc_id                                         = "vpc-07d4e8828e405ba5b"
    }

  # aws_vpc_security_group_egress_rule.allow_slave_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_slave_egress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # aws_vpc_security_group_egress_rule.egress_from_master_sg will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Egress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # aws_vpc_security_group_ingress_rule.allow_internet_traffic_global will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_internet_traffic_global" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # aws_vpc_security_group_ingress_rule.allow_slave_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_slave_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # aws_vpc_security_group_ingress_rule.ingress_from_master_sg will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Ingress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```

<!-- Sticky Pull Request Commentterraform-plan -->